diary/201607/11.org
#+TITLE:linux下安装texlive2016
#+AUTHOR:ALIANG
#+EMAIL:anbgsl1110@gmail.com
#+KEYWORDS:DIARY
【aliang diary】-青春无限可能，拎得清，爱生活，爱自己

-日期：2016-07-12；作者：阿亮；关键字：笔记、texlive
* linux下安装texlive2016
** 依赖包
    - 安装过程中需要调用Perl的模块Digest;MD5来检测ISO文件的完整性
    - 升级过程需要调用Perl的模块TK
*** CentOS下安装依赖包
#+BEGIN_SRC bash BASH
yum install perl-Digest-MD5
yum install perl-TK
#+END_SRC
*** Ubuntu下安装依赖包
#+BEGIN_SRC BASH
apt-get install libdigest-perl-md5-perl

apt-get install perl-tk
#+END_SRC
** 安装
*** 下载
**** 下载地址：
- 官方镜像：http://mirrors.ctan.org/systems/texlive/Images/texlive2016.iso
- USTC镜像: http://mirrors.ustc.edu.cn/CTAN/systems/texlive/Images/texlive2016.iso
*** 挂载ISO镜像
#+BEGIN_SRC BASH
su
mount -o loop texlive2016.iso /mnt/
cd /mnt
./install-t1
#+END_SRC
出现选项后，输入I直接安装(也可以更改选项)。
*** 环境变量
在当前用户的
#+BEGIN_SRC BASH
~/.bashrc
#+END_SRC
中加入如下语句
#+BEGIN_SRC BASH
# Tex live 2016
export MANPATH=${MANPATH}:/urs/local/texlive/2016/texmf-dist/doc/man
export INFOPATH=${INFOPATH}:/urs/local/texlive/2016/texmf-dist/doc/info
export PATH=${PATH}:/urs/local/texlive/2016/bin/x86_64-linux
#+END_SRC
*** 卸载ISO镜像
#+BEGIN_SRC BASH
cd
umount /mnt/
#+END_SRC
** 更新
*** 更新TexLive包管理器
#+BEGIN_SRC BASH
tlmgr update --self
#+END_SRC
*** 更新TexLive全部包
#+BEGIN_SRC BASH
tlmgr update --all
#+END_SRC
