diary/201607/11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">

<head>
  <title>linux下安装texlive2016</title>
  <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
  <meta name="title" content="linux下安装texlive2016" />
  <meta name="generator" content="Org-mode" />
  <meta name="generated" content="2016-07-22T20:01+0800" />
  <meta name="author" content="ALIANG" />
  <meta name="description" content="" />
  <meta name="keywords" content="DIARY" />

</head>

<body>

  <div id="preamble">

  </div>

  <div id="content">
    <h1 class="title">linux下安装texlive2016</h1>

    <p>【aliang diary】-青春无限可能，拎得清，爱生活，爱自己
    </p>
    <p>
      -日期：2016-07-12；作者：阿亮；关键字：笔记、texlive
    </p>
    <div id="table-of-contents">
      <h2>Table of Contents</h2>
      <div id="text-table-of-contents">
        <ul>
          <li><a href="#sec-1">1 linux下安装texlive2016</a>
            <ul>
              <li><a href="#sec-1-1">1.1 依赖包</a>
                <ul>
                  <li><a href="#sec-1-1-1">1.1.1 CentOS下安装依赖包</a></li>
                  <li><a href="#sec-1-1-2">1.1.2 Ubuntu下安装依赖包</a></li>
                </ul>
              </li>
              <li><a href="#sec-1-2">1.2 安装</a>
                <ul>
                  <li><a href="#sec-1-2-1">1.2.1 下载</a></li>
                  <li><a href="#sec-1-2-2">1.2.2 挂载ISO镜像</a></li>
                  <li><a href="#sec-1-2-3">1.2.3 环境变量</a></li>
                  <li><a href="#sec-1-2-4">1.2.4 卸载ISO镜像</a></li>
                </ul>
              </li>
              <li><a href="#sec-1-3">1.3 更新</a>
                <ul>
                  <li><a href="#sec-1-3-1">1.3.1 更新TexLive包管理器</a></li>
                  <li><a href="#sec-1-3-2">1.3.2 更新TexLive全部包</a></li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> linux下安装texlive2016</h2>
      <div class="outline-text-2" id="text-1">


      </div>

      <div id="outline-container-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span> 依赖包</h3>
        <div class="outline-text-3" id="text-1-1">

          <ul>
            <li>安装过程中需要调用Perl的模块Digest;MD5来检测ISO文件的完整性
            </li>
            <li>升级过程需要调用Perl的模块TK
            </li>
          </ul>


        </div>

        <div id="outline-container-1-1-1" class="outline-4">
          <h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> CentOS下安装依赖包</h4>
          <div class="outline-text-4" id="text-1-1-1">




            <pre class="src src-bash">yum install perl-Digest-MD5 yum install perl-TK
            </pre>

          </div>

        </div>

        <div id="outline-container-1-1-2" class="outline-4">
          <h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Ubuntu下安装依赖包</h4>
          <div class="outline-text-4" id="text-1-1-2">




            <pre class="src src-BASH">apt-get install libdigest-perl-md5-perl apt-get install perl-tk
            </pre>

          </div>
        </div>

      </div>

      <div id="outline-container-1-2" class="outline-3">
        <h3 id="sec-1-2"><span class="section-number-3">1.2</span> 安装</h3>
        <div class="outline-text-3" id="text-1-2">


        </div>

        <div id="outline-container-1-2-1" class="outline-4">
          <h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 下载</h4>
          <div class="outline-text-4" id="text-1-2-1">

            <ul>
              <li id="sec-1-2-1-1">下载地址：<br/>
                <ul>
                  <li>官方镜像：<a href="http://mirrors.ctan.org/systems/texlive/Images/texlive2016.iso">http://mirrors.ctan.org/systems/texlive/Images/texlive2016.iso</a>
                  </li>
                  <li>USTC镜像: <a href="http://mirrors.ustc.edu.cn/CTAN/systems/texlive/Images/texlive2016.iso">http://mirrors.ustc.edu.cn/CTAN/systems/texlive/Images/texlive2016.iso</a>
                  </li>
                </ul>

              </li>
            </ul>
          </div>

        </div>

        <div id="outline-container-1-2-2" class="outline-4">
          <h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 挂载ISO镜像</h4>
          <div class="outline-text-4" id="text-1-2-2">




            <pre class="src src-BASH">su mount -o loop texlive2016.iso /mnt/ cd /mnt ./install-t1
            </pre>

            <p>
              出现选项后，输入I直接安装(也可以更改选项)。
            </p>
          </div>

        </div>

        <div id="outline-container-1-2-3" class="outline-4">
          <h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 环境变量</h4>
          <div class="outline-text-4" id="text-1-2-3">

            <p>在当前用户的
            </p>


            <pre class="src src-BASH">~/.bashrc
            </pre>

            <p>
              中加入如下语句
            </p>


            <pre class="src src-BASH"># Tex live 2016 export MANPATH=${MANPATH}:/urs/local/texlive/2016/texmf-dist/doc/man export INFOPATH=${INFOPATH}:/urs/local/texlive/2016/texmf-dist/doc/info
              export PATH=${PATH}:/urs/local/texlive/2016/bin/x86_64-linux
            </pre>

          </div>

        </div>

        <div id="outline-container-1-2-4" class="outline-4">
          <h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> 卸载ISO镜像</h4>
          <div class="outline-text-4" id="text-1-2-4">




            <pre class="src src-BASH">cd umount /mnt/
            </pre>

          </div>
        </div>

      </div>

      <div id="outline-container-1-3" class="outline-3">
        <h3 id="sec-1-3"><span class="section-number-3">1.3</span> 更新</h3>
        <div class="outline-text-3" id="text-1-3">


        </div>

        <div id="outline-container-1-3-1" class="outline-4">
          <h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 更新TexLive包管理器</h4>
          <div class="outline-text-4" id="text-1-3-1">




            <pre class="src src-BASH">tlmgr update --self
            </pre>

          </div>

        </div>

        <div id="outline-container-1-3-2" class="outline-4">
          <h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> 更新TexLive全部包</h4>
          <div class="outline-text-4" id="text-1-3-2">




            <pre class="src src-BASH">tlmgr update --all
            </pre>

          </div>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble">
    <p class="date">Date: 2016-07-22T20:01+0800</p>
    <p class="author">Author: ALIANG</p>
    <p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version
      24</p>
    <a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

  </div>
</body>

</html>